marcoisabella/vibepulse/sdkconfig.defaults
# Startvärden för targetbygget. Flash-, PSRAM- och CPU-raderna är hämtade ur
# Waveshares egen demo (spec/hardware.md): kortet har oktal-PSRAM som måste
# klockas rätt, annars startar panelen inte alls.
CONFIG_IDF_TARGET="esp32s3"

# 16 MB QIO-flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# En ny OTA-avbild måste klara Torgets lokala hälsogrind vid första boot;
# tills den godkänts kan bootloadern rulla tillbaka till förra luckan.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 8 MB oktal-PSRAM med XIP: LVGL:s ritbuffertar (480x50 dubbelbuffrat) bor här
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# (2026-08-16: prövade CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP för att lätta det
# interna heapet — gjorde det VÄRRE, min-fritt föll till 16 byte och LVGL-tasken
# fastnade i låst render. Reverterat. Roten är LVGL:s 96 KB-pool i internt BSS;
# rätt fix mäts fram i diag-heartbeaten innan den sätts.)

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# LVGL: bara de widgets UI:t faktiskt använder. Montserrat 14 finns kvar som
# LV_FONT_DEFAULT — våra Plex-fonter sätts explicit på varje etikett, men
# LVGL vill ha en defaultfont som existerar.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_SPAN=y
CONFIG_LV_USE_TILEVIEW=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_DEF_REFR_PERIOD=15

# HTTPS mot solelkollen.se via certifikatbunten: ingen pinning att underhålla,
# överlever certrotation (beslutsloggen i README).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Vibbes USB/audio-tasker behöver internminnet och mbedTLS behöver ungefär
# 42 kB per HTTPS-anslutning. Lägg därför TLS-allokeringarna i kortets 8 MB
# PSRAM; annars saknar Solelkollen ett sammanhängande block efter Vibbe-init.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Nätverkstacken får jobba på: en hämtning var 30:e sekund är ingen last, men
# en blockerad TLS-handskakning ska inte svälta LVGL-tasken.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
# LVGL-poolen: 256 KB nu när den bor i PSRAM (frysfix 2026-08-16, se
# rot-CMakeLists + main/lv_psram_pool.c). Rymligt eftersom PSRAM har 6,4 MB;
# ger Needs You-takeovern + GitHub-sidan + alla appar gott om objektutrymme
# utan att röra det interna heapet där panelflushens DMA-buffert bor.
CONFIG_LV_MEM_SIZE_KILOBYTES=256

# --- Vibbe (app_buddy) --- USB-ljudkortsläget. Parametrarna bor i Kconfig,
# inte i uac_device_config_t (bänkläxa 2026-08-07: default är 48 kHz medan
# hela ljudnavet antar 16 kHz, och utan macOS-flaggan blir feedback-formatet
# fel med hackigt ljud som symptom).
CONFIG_UAC_SAMPLE_RATE=16000
CONFIG_UAC_SUPPORT_MACOS=y
CONFIG_UAC_TUSB_PRODUCT="Vibbe"

# --- Torget --- Panelen står på en hylla och ska gå att läsa tvärs över
# rummet utan att först bli petad på, så viloläget är avstängt: ljuset
# ligger kvar på BRIGHT_DAY jämt. Rampen själv finns kvar — boot-faden
# från svart går samma väg upp. Priset är namngivet i Kconfig-hjälpen:
# en AMOLED som hålls på full effekt åldras fortare, och den här skärmen
# visar en i stort sett stillastående bild.
CONFIG_TORGET_IDLE_DIM=n
